### AWS UAT App plan Part # 3
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

   -> (known after apply)
          ~ key = "assets/Landing-db7eac9c.js" -> "assets/_name_-47568c73.js"
        },
      ~ {
          ~ id  = "assets/PDF-19838165.css" -> (known after apply)
          ~ key = "assets/PDF-19838165.css" -> "assets/about-d6b2d3af.js"
        },
      ~ {
          ~ id  = "assets/PDF-a433cf2a.js" -> (known after apply)
          ~ key = "assets/PDF-a433cf2a.js" -> "assets/app-3fb78100.js"
        },
      ~ {
          ~ id  = "assets/Start-b82ce7ab.js" -> (known after apply)
          ~ key = "assets/Start-b82ce7ab.js" -> "assets/home-9e3f4fe0.js"
        },
      ~ {
          ~ id  = "assets/StartButtonFloat-7308c767.css" -> (known after apply)
          ~ key = "assets/StartButtonFloat-7308c767.css" -> "assets/index-f44d04de.css"
        },
      ~ {
          ~ id  = "assets/StartButtonFloat-d1e323fd.js" -> (known after apply)
          ~ key = "assets/StartButtonFloat-d1e323fd.js" -> "assets/virtual_pwa-register-181e8f91.js"
        },
      ~ {
          ~ id  = "assets/Terminal-12d70089.js" -> (known after apply)
          ~ key = "assets/Terminal-12d70089.js" -> "assets/workbox-window.prod.es5-295a6886.js"
        },
      ~ {
          ~ id  = "assets/Terminal-2e2ec67e.css" -> (known after apply)
          ~ key = "assets/Terminal-2e2ec67e.css" -> "favicon-dark.svg"
        },
      ~ {
          ~ id  = "assets/azure_devicon_forest_green-ee780a3a.svg" -> (known after apply)
          ~ key = "assets/azure_devicon_forest_green-ee780a3a.svg" -> "favicon.svg"
        },
      - {
          - id  = "assets/bash_devicon_forest_green-ab536553.svg"
          - key = "assets/bash_devicon_forest_green-ab536553.svg"
        },
      - {
          - id  = "assets/d3_devicon_forest_green-b8696bec.svg"
          - key = "assets/d3_devicon_forest_green-b8696bec.svg"
        },
      - {
          - id  = "assets/devicons-4cbd2440.woff"
          - key = "assets/devicons-4cbd2440.woff"
        },
      - {
          - id  = "assets/devicons-880373aa.eot"
          - key = "assets/devicons-880373aa.eot"
        },
      - {
          - id  = "assets/devicons-cbb92633.ttf"
          - key = "assets/devicons-cbb92633.ttf"
        },
      - {
          - id  = "assets/devicons-d7c9f264.svg"
          - key = "assets/devicons-d7c9f264.svg"
        },
      - {
          - id  = "assets/fontawesome-webfont-2adefcbc.woff2"
          - key = "assets/fontawesome-webfont-2adefcbc.woff2"
        },
      - {
          - id  = "assets/fontawesome-webfont-7bfcab6d.eot"
          - key = "assets/fontawesome-webfont-7bfcab6d.eot"
        },
      - {
          - id  = "assets/fontawesome-webfont-aa58f33f.ttf"
          - key = "assets/fontawesome-webfont-aa58f33f.ttf"
        },
      - {
          - id  = "assets/fontawesome-webfont-ad615792.svg"
          - key = "assets/fontawesome-webfont-ad615792.svg"
        },
      - {
          - id  = "assets/fontawesome-webfont-ba0c59de.woff"
          - key = "assets/fontawesome-webfont-ba0c59de.woff"
        },
      - {
          - id  = "assets/github_profile_pic-66b10136.jpg"
          - key = "assets/github_profile_pic-66b10136.jpg"
        },
      - {
          - id  = "assets/html2canvas.esm-0a33ed42.js"
          - key = "assets/html2canvas.esm-0a33ed42.js"
        },
      - {
          - id  = "assets/index-9a0f5c31.css"
          - key = "assets/index-9a0f5c31.css"
        },
      - {
          - id  = "assets/index-f711b34b.js"
          - key = "assets/index-f711b34b.js"
        },
      - {
          - id  = "assets/index.es-1ae83452.js"
          - key = "assets/index.es-1ae83452.js"
        },
      - {
          - id  = "assets/powershell_devicon_forest_green-f06a1fda.svg"
          - key = "assets/powershell_devicon_forest_green-f06a1fda.svg"
        },
      - {
          - id  = "assets/purify.es-3ef59d4c.js"
          - key = "assets/purify.es-3ef59d4c.js"
        },
      - {
          - id  = "assets/recase-24e0a860.js"
          - key = "assets/recase-24e0a860.js"
        },
      - {
          - id  = "assets/tableau_logo-ec7acb2d.svg"
          - key = "assets/tableau_logo-ec7acb2d.svg"
        },
      - {
          - id  = "assets/terraform_devicon_forest_green-e7c4748a.svg"
          - key = "assets/terraform_devicon_forest_green-e7c4748a.svg"
        },
      - {
          - id  = "assets/ts_devicon_forest_green-0c5eea9d.svg"
          - key = "assets/ts_devicon_forest_green-0c5eea9d.svg"
        },
      - {
          - id  = "assets/vue_devicon_forest_green-2e14a2aa.svg"
          - key = "assets/vue_devicon_forest_green-2e14a2aa.svg"
        },
      - {
          - id  = "favicon.ico"
          - key = "favicon.ico"
        },
        {
            id  = "index.html"
            key = "index.html"
        },
      + {
          + id  = (known after apply)
          + key = "manifest.webmanifest"
        },
      + {
          + id  = (known after apply)
          + key = "pwa-192x192.png"
        },
      + {
          + id  = (known after apply)
          + key = "pwa-512x512.png"
        },
      + {
          + id  = (known after apply)
          + key = "readme.html"
        },
      + {
          + id  = (known after apply)
          + key = "robots.txt"
        },
      + {
          + id  = (known after apply)
          + key = "safari-pinned-tab.svg"
        },
      + {
          + id  = (known after apply)
          + key = "sitemap.xml"
        },
      + {
          + id  = (known after apply)
          + key = "ssr-manifest.json"
        },
      + {
          + id  = (known after apply)
          + key = "sw.js"
        },
      + {
          + id  = (known after apply)
          + key = "workbox-01d9f47c.js"
        },
    ]
  ~ s3_bucket_object_version_ids = [
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-af54e33e.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/About-af54e33e.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-45b80bcd.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/ArticleLayouts-45b80bcd.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-abc200d4.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/Articles-abc200d4.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-cdca7afd.css"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/Articles-cdca7afd.css"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-ad247451.css"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/Landing-ad247451.css"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-db7eac9c.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/Landing-db7eac9c.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-19838165.css"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/PDF-19838165.css"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-a433cf2a.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/PDF-a433cf2a.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-b82ce7ab.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/Start-b82ce7ab.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartButtonFloat-7308c767.css"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/StartButtonFloat-7308c767.css"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartButtonFloat-d1e323fd.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/StartButtonFloat-d1e323fd.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Terminal-12d70089.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/Terminal-12d70089.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Terminal-2e2ec67e.css"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/Terminal-2e2ec67e.css"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/azure_devicon_forest_green-ee780a3a.svg"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/azure_devicon_forest_green-ee780a3a.svg"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/bash_devicon_forest_green-ab536553.svg"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/bash_devicon_forest_green-ab536553.svg"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/d3_devicon_forest_green-b8696bec.svg"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/d3_devicon_forest_green-b8696bec.svg"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/devicons-4cbd2440.woff"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/devicons-4cbd2440.woff"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/devicons-880373aa.eot"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/devicons-880373aa.eot"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/devicons-cbb92633.ttf"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/devicons-cbb92633.ttf"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/devicons-d7c9f264.svg"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/devicons-d7c9f264.svg"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/fontawesome-webfont-2adefcbc.woff2"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/fontawesome-webfont-2adefcbc.woff2"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/fontawesome-webfont-7bfcab6d.eot"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/fontawesome-webfont-7bfcab6d.eot"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/fontawesome-webfont-aa58f33f.ttf"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/fontawesome-webfont-aa58f33f.ttf"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/fontawesome-webfont-ad615792.svg"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/fontawesome-webfont-ad615792.svg"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/fontawesome-webfont-ba0c59de.woff"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/fontawesome-webfont-ba0c59de.woff"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/github_profile_pic-66b10136.jpg"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/github_profile_pic-66b10136.jpg"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/html2canvas.esm-0a33ed42.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/html2canvas.esm-0a33ed42.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index-9a0f5c31.css"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/index-9a0f5c31.css"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index-f711b34b.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/index-f711b34b.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-1ae83452.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/index.es-1ae83452.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/powershell_devicon_forest_green-f06a1fda.svg"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/powershell_devicon_forest_green-f06a1fda.svg"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/purify.es-3ef59d4c.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/purify.es-3ef59d4c.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/recase-24e0a860.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/recase-24e0a860.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/tableau_logo-ec7acb2d.svg"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/tableau_logo-ec7acb2d.svg"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/terraform_devicon_forest_green-e7c4748a.svg"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/terraform_devicon_forest_green-e7c4748a.svg"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ts_devicon_forest_green-0c5eea9d.svg"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/ts_devicon_forest_green-0c5eea9d.svg"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/vue_devicon_forest_green-2e14a2aa.svg"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/vue_devicon_forest_green-2e14a2aa.svg"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["favicon.ico"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "favicon.ico"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["index.html"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "index.html"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["_headers"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.marshmallowmeat.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "text/plain"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "_headers"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/_headers"%0A      + source_hash            = "8274f68f0ec4b7bd6eab988987eaf299"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["about.html"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.marshmallowmeat.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "about.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/about.html"%0A      + source_hash            = "7f5638b311d706f2b107afbdffb99cb7"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/404-8c89564b.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.marshmallowmeat.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/404-8c89564b.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/404-8c89564b.js"%0A      + source_hash            = "ed91a87c4d3fc86a5c1c2fdf99c5fead"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-af54e33e.js"] will be destroyed%0A  # (because key ["assets/About-af54e33e.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "a92e5bf9ff9dec037b5e5a818228e383" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/About-af54e33e.js" -> null%0A      - key                    = "assets/About-af54e33e.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/About-af54e33e.js" -> null%0A      - source_hash            = "a92e5bf9ff9dec037b5e5a818228e383" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-45b80bcd.js"] will be destroyed%0A  # (because key ["assets/ArticleLayouts-45b80bcd.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "6aea85fb90c9a61defc42ea2f1bdd960" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/ArticleLayouts-45b80bcd.js" -> null%0A      - key                    = "assets/ArticleLayouts-45b80bcd.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/ArticleLayouts-45b80bcd.js" -> null%0A      - source_hash            = "6aea85fb90c9a61defc42ea2f1bdd960" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-abc200d4.js"] will be destroyed%0A  # (because key ["assets/Articles-abc200d4.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "7e1dfd2dc8a5ee4b4955c4dab9170982" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/Articles-abc200d4.js" -> null%0A      - key                    = "assets/Articles-abc200d4.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/Articles-abc200d4.js" -> null%0A      - source_hash            = "7e1dfd2dc8a5ee4b4955c4dab9170982" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-cdca7afd.css"] will be destroyed%0A  # (because key ["assets/Articles-cdca7afd.css"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "text/css" -> null%0A      - etag                   = "d254e9f4850a323e5ea30df3ac31964d" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/Articles-cdca7afd.css" -> null%0A      - key                    = "assets/Articles-cdca7afd.css" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/Articles-cdca7afd.css" -> null%0A      - source_hash            = "d254e9f4850a323e5ea30df3ac31964d" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-ad247451.css"] will be destroyed%0A  # (because key ["assets/Landing-ad247451.css"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "text/css" -> null%0A      - etag                   = "623d1343a7416bbbdbce909629e9939d" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/Landing-ad247451.css" -> null%0A      - key                    = "assets/Landing-ad247451.css" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/Landing-ad247451.css" -> null%0A      - source_hash            = "623d1343a7416bbbdbce909629e9939d" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-db7eac9c.js"] will be destroyed%0A  # (because key ["assets/Landing-db7eac9c.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "17c5dfdc342c2416f507ad7fcb8b9682" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/Landing-db7eac9c.js" -> null%0A      - key                    = "assets/Landing-db7eac9c.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/Landing-db7eac9c.js" -> null%0A      - source_hash            = "17c5dfdc342c2416f507ad7fcb8b9682" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-19838165.css"] will be destroyed%0A  # (because key ["assets/PDF-19838165.css"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "text/css" -> null%0A      - etag                   = "e24945a32789e1abf50be49be251389e" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/PDF-19838165.css" -> null%0A      - key                    = "assets/PDF-19838165.css" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/PDF-19838165.css" -> null%0A      - source_hash            = "e24945a32789e1abf50be49be251389e" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-a433cf2a.js"] will be destroyed%0A  # (because key ["assets/PDF-a433cf2a.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "8d89581807d6c1c618e266b88c96e702" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/PDF-a433cf2a.js" -> null%0A      - key                    = "assets/PDF-a433cf2a.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/PDF-a433cf2a.js" -> null%0A      - source_hash            = "8d89581807d6c1c618e266b88c96e702" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/README-8752f6ce.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.marshmallowmeat.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/README-8752f6ce.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/README-8752f6ce.js"%0A      + source_hash            = "b0529af8bda37bb2fc536eb4984dd0dd"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-b82ce7ab.js"] will be destroyed%0A  # (because key ["assets/Start-b82ce7ab.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "af5ebf02485dec5a476c3d41e227aa5c" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/Start-b82ce7ab.js" -> null%0A      - key                    = "assets/Start-b82ce7ab.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/Start-b82ce7ab.js" -> null%0A      - source_hash            = "af5ebf02485dec5a476c3d41e227aa5c" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartButtonFloat-7308c767.css"] will be destroyed%0A  # (because key ["assets/StartButtonFloat-7308c767.css"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "text/css" -> null%0A      - etag                   = "fff573f20a9b2c51b01a41b063cbf6bd" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/StartButtonFloat-7308c767.css" -> null%0A      - key                    = "assets/StartButtonFloat-7308c767.css" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/StartButtonFloat-7308c767.css" -> null%0A      - source_hash            = "fff573f20a9b2c51b01a41b063cbf6bd" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartButtonFloat-d1e323fd.js"] will be destroyed%0A  # (because key ["assets/StartButtonFloat-d1e323fd.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "538edd160449fc19008186b8965f28a7" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/StartButtonFloat-d1e323fd.js" -> null%0A      - key                    = "assets/StartButtonFloat-d1e323fd.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/StartButtonFloat-d1e323fd.js" -> null%0A      - source_hash            = "538edd160449fc19008186b8965f28a7" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Terminal-12d70089.js"] will be destroyed%0A  # (because key ["assets/Terminal-12d70089.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "66964670c414b9f1a947e184fd286b37" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/Terminal-12d70089.js" -> null%0A      - key                    = "assets/Terminal-12d70089.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/Terminal-12d70089.js" -> null%0A      - source_hash            = "66964670c414b9f1a947e184fd286b37" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Terminal-2e2ec67e.css"] will be destroyed%0A  # (because key ["assets/Terminal-2e2ec67e.css"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "text/css" -> null%0A      - etag                   = "85561bf1ef41088b8c3f0f50a6a1fa81" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/Terminal-2e2ec67e.css" -> null%0A      - key                    = "assets/Terminal-2e2ec67e.css" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/Terminal-2e2ec67e.css" -> null%0A      - source_hash            = "85561bf1ef41088b8c3f0f50a6a1fa81" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/_...all_-0334078a.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.marshmallowmeat.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/_...all_-0334078a.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/_...all_-0334078a.js"%0A      + source_hash            = "b20c613676ee4799b1f0002e858d6baf"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/_name_-47568c73.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.marshmallowmeat.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/_name_-47568c73.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/_name_-47568c73.js"%0A      + source_hash            = "5f21036c944817e3d81eb51f55c502ef"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/about-d6b2d3af.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.marshmallowmeat.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/about-d6b2d3af.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/about-d6b2d3af.js"%0A      + source_hash            = "faf121b0bd4ec63bc3adf0c9eaa79137"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/app-3fb78100.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.marshmallowmeat.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply
  ```
  </details>
  *Pusher: @shortpoet, Action: `pull_request`, Working Directory: ``, Workflow: `App Infra`*